use Polyclinic;
insert into Patient (FIO, ContactNumber, DispAccounting, DateBirth) values 
('Иванов Иван Иванович', '88005553535', 1, '1971-08-12'),
('Петров Петр Петрович', '89156543098', 0, '1967-01-20'),
('Кириллина Екатерина Олеговна', '89047650189', 1, '1989-03-02'),
('Рамазанов Тарас Гаврннлович', '89571025512', 0, '1988-07-07'),
('Кулибин Герасим Арсеньевич', '89073425861', 1, '1974-11-23'),
('Томсина Милана Вячеславовна', '89569439930', 1, '1985-03-02'),
('Колокольцова Галина Евгеньевна', '89669199425', 0, '1988-07-11'),
('Бочаров Леонтий Порфирьевич', '89418697433', 0, '1968-03-06'),
('Каменева Марианна Якововна', '89534845959', 1, '1991-07-14'),
('Ходяева Светлана Никитьевна', '89845088436', 1, '1979-02-16'),
('test', 'test', 1, '1111-11-11');

insert into Post(PostName)
values 
('Главный врач'),
('Директор'),
('Заместитель руководителя'),
('Заведующий структурного подразделения'),
('Главная медицинская сестра'),
('Врач-специалист'),
('Врач-стажер'),
('Лаборант'),
('Медицинская сестра'),
('Фельдшер');

insert into Speciality(SpecialityName)
values 
('акушер-гинеколог'),
('аллерголог-иммунолог'),
('анестезиолог-реаниматолог'),
('бактериолог'),
('вирусолог'),
('гастроэнтеролог'),
('гематолог'),
('генетик'),
('гериатр'),
('дезинфектолог'),
('дерматовенеролог'),
('детский кардиолог'),
('детский онколог'),
('детский уролог-андролог'),
('детский хирург'),
('детский эндокринолог'),
('диабетолог'),
('диетолог'),
('инфекционист'),
('кардиолог'),
('клинический миколог'),
('колопроктолог'),
('косметолог'),
('лаборант'),
('методист'),
('невролог'),
('нейрохирург'),
('неонатолог'),
('нефролог'),
('онколог'),
('ортодонт'),
('педиатр');


insert into Diagnosis (DiagnosisName)
values 
('Гастрит'),
('Ожирение'),
('Аллергия'),
('Алопеция'),
('Кариес'),
('Гайморит'),
('ОРВИ'),
('Чесотка'),
('Грипп'),
('Язва желудка'),
('Депрессия');


insert into Doctor(FIO, ContactNumber, SpecialityId, PostId)
values 
('Соломахин Тимофей Тимофеевич', '89559579497', 1, 6),
('Сиваков Максим Гаврннлович', '89245256026',2, 6),
('Заславская Жанна Степановна', '89436342339',3, 6),
('Гриневец Дмитрий Михаилович', '89819695319',5, 1),
('Аргамаков Иван Прокльев', '89321131512', 11, 7),
('Фетисов Виталий Ефимович', '89434452613', 24, 8),
('Пестова Любовь Евгеньевна', '89187672568', 28, 6),
('Макаров Игнат Тарасович', '89881894515', 32, 6),
('Харламов Михаил Ефимович', '89563733097', 32, 6),
('Ястребова Ксения Константиновна', '89515987519',32,6);


insert into Reception (DiagnosisId, DoctorId, PatientId, Medical, OutpatientTreatment, VisitDate)
values 
(1, 31, 1, 7, 1, '2022-09-08'),
(2, 32, 2, 0, 0, '2021-07-14'),
(3, 33, 3, 0, 0, '2022-04-29'),
(4, 34, 4, 12, 1, '2022-06-06'),
(5, 35, 5, 0, 0, '2019-11-11'),
(6, 36, 6, 9, 1, '2021-04-05'),
(7, 37, 7, 0, 0, '2021-03-03'),
(8, 38, 8, 0, 0, '2019-08-08'),
(9, 39, 9, 0, 0, '2022-04-04'),
(10, 40, 10, 1, 1, '2019-02-02');



select * from Diagnosis;
select * from Patient;
select * from Doctor;
select * from Reception;
select * from Post;
select * from Speciality;

--update, delete--

update Patient
set FIO = 'test_FIO' where FIO ='test';

delete from Patient
where PatientId=11;